INSERT INTO sports (name) VALUES
('Футбол'),
('Баскетбол'),
('Теннис'),
('Плавание'),
('Лёгкая атлетика'),
('Волейбол'),
('Бокс');


INSERT INTO athletes (name, surname, patronymic) VALUES
('Иван', 'Иванов', 'Иванович'),
('Петр', 'Петров', 'Петрович'),
('Сергей', 'Сергеев', 'Сергеевич'),
('Анна', 'Аннова', 'Алексеевна'),
('Мария', 'Марина', 'Семеновна'),
('Дмитрий', 'Дмитриев', 'Дмитриевич'),
('Игорь', 'Мангараков', 'Дмитриевич'), 
('Владимир', 'Бокк', 'Алексеевич'),
('Ольга', 'Оленькова', 'Васильевна'),
('Маргарита', 'Певзнер', 'Васильевна'),
('Олег', 'Ломп', 'Васильевич'),
('Григорий', 'Фриауф', 'Григорьевич'),
('Владислав', 'Мартиросян', NULL);


INSERT INTO competitions (name, season, competition_date) VALUES
('Чемпионат мира по футболу', 'Лето', '2024-06-15'),
('Летние Олимпийские игры', 'Лето', '2024-07-23'),
('Чемпионат мира по баскетболу', 'Осень', '2024-09-12'),
('Турнир по теннису', 'Весна', '2024-05-18'),
('Плавательный чемпионат', 'Лето', '2024-08-10'),
('Чемпионат по волейболу', 'Осень', '2024-10-01'),
('Чемпионат по боксу', 'Зима', '2024-12-15'),
('Национальный чемпионат по футболу', 'Осень', '2024-11-05'),
('Международный турнир по теннису', 'Весна', '2024-04-20'),
('Гран-при по плаванию', 'Лето', '2024-06-25'),
('Суперкубок по баскетболу', 'Зима', '2024-01-15'),
('Чемпионат Европы по лёгкой атлетике', 'Лето', '2024-07-10');


INSERT INTO competition_sports (competition_id, sport_id) VALUES
(1, 1), 
(2, 1), 
(3, 2), 
(4, 3), 
(5, 4), 
(6, 6), 
(7, 7), 
(2, 4), 
(3, 5),  
(1, 2),
(8, 1),  
(9, 3),  
(10, 4), 
(11, 2), 
(12, 5); 


INSERT INTO results (athlete_id, competition_id, result, prize_money) VALUES
(1, 1, 1, 50000.00),
(2, 1, 2, 30000.00),
(3, 3, 1, 25000.00),
(4, 4, 1, 20000.00),
(5, 5, 3, 15000.00),
(6, 6, 4, 10000.00),
(7, 7, 5, 8000.00),
(1, 2, 4, 5000.00),
(2, 3, 5, 7000.00),
(3, 5, 6, 6000.00),
(4, 6, 2, 3000.00),
(5, 7, 1, 1000.00),
(8, 1, 2, 45000.00),  
(9, 2, 1, 35000.00),  
(10, 3, 3, 15000.00), 
(11, 4, 2, 25000.00), 
(12, 5, 1, 20000.00), 
(13, 6, 5, 5000.00),
(1, 8, 1, 70000.00),  
(9, 9, 2, 60000.00),  
(2, 10, 3, 15000.00),  
(3, 11, 4, 30000.00),  
(4, 12, 2, 20000.00),

